In [8]:
import pandas as pd

In [12]:
df = pd.read_csv("../data/sales_data.csv")
df

   order_id customer region  amount month
0         1        A  North     500   Jan
1         2        B  South     200   Jan
2         3        A  North     300   Feb
3         4        C   East     700   Feb
4         5        B  South     400   Feb
5         6        D  North     150   Jan

In [19]:
df.groupby("region",as_index=False)["amount"].sum()

  region  amount
0   East     700
1  North     950
2  South     600

In [21]:
df.groupby("month",as_index=False)["amount"].sum()

  month  amount
0   Feb    1400
1   Jan     850

In [28]:
total_sales=df["amount"].sum()
customer_sales=df.groupby("customer")["amount"].sum()
customer_sales[customer_sales>0.25*total_sales]

customer
A    800
B    600
C    700
Name: amount, dtype: int64

## Key Insights

- The North region generated the highest sales.
- February had higher total sales than January.
- Customer A contributed the highest share of revenue.

## Business Recommendation

Focus on high-performing regions and retain high-value customers through targeted offers.

In [1]:
#SQL
#1️⃣ Total sales by region
#select region,sum(amount) from data group by region;


#2️⃣ Average order amount by customer
#select customer,avg(amount) from data group by customer;

#3️⃣ Month-wise total sales
#select month,sum(amount) from data group by month;

#4️⃣ Customers with total sales > 600
#select customer,sum(amount) from data group by customer having sum(amount)>600